#include <iostream>

#include <string>

using namespace std;
//---------------------Функции и Прототипы---------------------------------------





//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");
	
	//-------------------------------САМА ПРОГА-------------------------------------
	string in;
	int x;
	cout << "Введите последовательость цифр: ";
	cin >> in;
	
	cout << "Введите порядковый номер числа: ";
	cin >> x;

	cout << "Под этим номером расположена цифра: " << in[x - 1] << endl;





	system("pause");

	return 0;
}
